Сверт2.ОценкаСостоянияПредприятия/src/DataProcessors/ИнтеграцияБизнесАналитик/ИнтеграцияБизнесАналитик.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ИнтеграцияБизнесАналитик</name>
</mdclass:DataProcessor>

Сверт2.ОценкаСостоянияПредприятия/src/InformationRegisters/НастройкиИнтеграции/НастройкиИнтеграции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиИнтеграции</name>
  <resources>
    <name>ПутьДоБазы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Пароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ГУИД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДрайверКлиента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Кодировка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
</mdclass:InformationRegister>

Сверт2.ОценкаСостоянияПредприятия/src/InformationRegisters/ПоказателиДляОтчета/ПоказателиДляОтчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПоказателиДляОтчета</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>Оценка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Показатель</name>
    <type>
      <types>CatalogRef.ОценкиБА</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Сверт2.ОценкаСостоянияПредприятия/src/Catalogs/ОценкиБА/ОценкиБА.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ОценкиБА</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьВОтчет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойПоказатель</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПоПорядку</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Сверт2.ОценкаСостоянияПредприятия/src/DataProcessors/ИнтеграцияБизнесАналитик/Forms/Форма/Module.bsl
&НаСервере

Процедура ЗаполнитьНаСервере()

	Показатели.Очистить();

	Показатели.Загрузить(Основание.Показатели.Выгрузить());

КонецПроцедуры



&НаКлиенте

Процедура Заполнить(Команда)

	ЗаполнитьНаСервере();

КонецПроцедуры



&НаСервере

Процедура ОтправитьБАНаСервере()

	Подключение = НастройкиПодключения();

	мСоединение = Новый COMОбъект("ADODB.Connection");

	мСоединение.ConnectionString = "Driver=Firebird/InterBase(r) driver;" +

	"Dbname=" + Подключение.ПутьДоБазы +

	"Uid=" + Подключение.ГУИД +

	"Pwd=" + Подключение.Пароль +

	"CHARSET=" + Подключение.Кодировка +

	"client=" + Подключение.ДрайверКлиента;

	

	мСоединение.ConnectionTimeout = 1200;

	мСоединение.CursorLocation = 3;

	

	Try

		мСоединение.Open(мСоединение.ConnectionString);

	Except

		Сообщить("Не удалось выполнить подключение " + ОписаниеОшибки());

		Return;

	EndTry;

	

	ПоказателиКодов = ПоказателиКодов();

	

	Для Каждого Строка Из Показатели Цикл

		КодыПоказателей = ПоказателиКодов.Получить(Строка.Показатель);

		Для Каждого Код Из КодыПоказателей Цикл

			Try
				Если Строка.Сумма = 0 Тогда
					Сумма = "0"; 
				Иначе
					//Сумма = Формат(Окр(Строка.Сумма,0),"ЧГ=0");
					Сумма  = Формат(Строка.Сумма, "ЧРД=.; ЧГ=0");;

				КонецЕсли;
				
				Запрос = СтрШаблон("UPDATE VAL_POKAZATELI SET VAL_DIAPAZ = %1 WHERE ID_POKAZATELI = %2;", Сумма, Код);

				мСоединение.Execute(Запрос);

			Except

				Сообщить("Не удалось выполнить запрос " + ОписаниеОшибки());

				мСоединение.Close();

				Return;

			EndTry;

		КонецЦикла;

	КонецЦикла;

	
    ОбщегоНазначения.СообщитьПользователю("Данные успешно отправлены в Бизнес Аналитик");
КонецПроцедуры



&НаКлиенте

Процедура ОтправитьБА(Команда)

	ОтправитьБАНаСервере();

КонецПроцедуры



&НаСервере

Функция НастройкиПодключения()

	

	НовоеПодключение = Новый Структура("ПутьДоБазы,Пароль,ГУИД,ДрайверКлиента,Кодировка");

	

	Запрос = Новый Запрос;

	Запрос.Текст =

	"ВЫБРАТЬ

	|	Найстроки.ПутьДоБазы КАК ПутьДоБазы,

	|	Найстроки.Пароль КАК Пароль,

	|	Найстроки.ГУИД КАК ГУИД,

	|	Найстроки.ДрайверКлиента КАК ДрайверКлиента,

	|	Найстроки.Кодировка КАК Кодировка

	|ИЗ

	|	РегистрСведений.НастройкиИнтеграции КАК Найстроки";

	

	РезультатЗапроса = Запрос.Выполнить();

	Выборка = РезультатЗапроса.Выбрать();

	

	Пока Выборка.Следующий() Цикл

		ЗаполнитьЗначенияСвойств(НовоеПодключение, Выборка);

	КонецЦикла;

	

	Возврат НовоеПодключение;

	

КонецФункции



&НаСервере

Функция ПоказателиКодов()

	

	НовоеПодключение = Новый Соответствие();

	

	Запрос = Новый Запрос;

	Запрос.Текст =

	"ВЫБРАТЬ

	|	Показатели.Ссылка КАК Ссылка,

	|	Показатели.КодFireBird КАК Код

	|ИЗ

	|	Справочник.Показатели КАК Показатели";

	

	РезультатЗапроса = Запрос.Выполнить();

	Выборка = РезультатЗапроса.Выбрать();

	

	Пока Выборка.Следующий() Цикл

		МассивКодов = СтрРазделить(Выборка.Код, ",");

		НовоеПодключение.Вставить(Выборка.Ссылка, МассивКодов);

	КонецЦикла;

	

	Возврат НовоеПодключение;

	

КонецФункции



&НаСервере

Процедура ИнтерпретацияНаСервере()

	

	Подключение = НастройкиПодключения();

	мСоединение = Новый COMОбъект("ADODB.Connection");

	мСоединение.ConnectionString = "Driver=Firebird/InterBase(r) driver;" +

	"Dbname=" + Подключение.ПутьДоБазы +

	"Uid=" + Подключение.ГУИД +

	"Pwd=" + Подключение.Пароль +

	"CHARSET=" + Подключение.Кодировка +

	"client=" + Подключение.ДрайверКлиента;

	

	мСоединение.ConnectionTimeout = 1200;

	мСоединение.CursorLocation = 3;

	

	Try

		мСоединение.Open(мСоединение.ConnectionString);

	Except

		Сообщить("Не удалось выполнить подключение " + ОписаниеОшибки());

		Return;

	EndTry;

	

	Макет = Обработки.ИнтеграцияБизнесАналитик.ПолучитьМакет("Макет_ID_Показателей");

	ТекстJSON = Макет.ПолучитьТекст();

	

	Чтение = Новый ЧтениеJSON;

	Чтение.УстановитьСтроку(ТекстJSON);

	Данные = ПрочитатьJSON(Чтение);

	Чтение.Закрыть();

	

	ЗначенияПоКоду = Новый Соответствие;

	

	Try

		Для Каждого Строка Из Данные Цикл

			

			Запрос = СтрШаблон("SELECT VAL_U FROM USLI_VAL WHERE ID_USLI = %1;", Число(Строка.код));

			Результат = мСоединение.Execute(Запрос);

			

			VAL_U = Неопределено;

			Если НЕ (Результат.BOF И Результат.EOF) Тогда

				VAL_U = Результат.Fields("VAL_U").Value;

			КонецЕсли;

			

			Если VAL_U = Неопределено Тогда

				Продолжить;

			КонецЕсли;

			

			ЗначенияПоКоду.Вставить(СокрЛП(Строка(Строка.код)), Число(VAL_U));

			

			Менеджер = РегистрыСведений.ПоказателиДляОтчета.СоздатьМенеджерЗаписи();

			Менеджер.Показатель = Справочники.ОценкиБА.НайтиПоКоду(Строка.код);

			Менеджер.Организация = Основание.Организация;

			Менеджер.Период = НачалоМесяца(ПериодОценки);

			Менеджер.Прочитать();

			Менеджер.Показатель = Справочники.ОценкиБА.НайтиПоКоду(Строка.код);

			Менеджер.Организация = Основание.Организация;

			Менеджер.Период = НачалоМесяца(ПериодОценки);

			Менеджер.Оценка = Число(VAL_U);

			Менеджер.Записать();

			

		КонецЦикла;

	Except

		Сообщить("Не удалось выполнить запрос " + ОписаниеОшибки());

		мСоединение.Close();

		Return;

	EndTry;

	

	мСоединение.Close();

	ЗаполнитьДеревоПоказателей(ЗначенияПоКоду);

КонецПроцедуры

&НаКлиенте
Процедура Интерпретация(Команда)
	Если ПроверитьЗаполнение() Тогда
		ИнтерпретацияНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(ПериодОценки) Тогда
		ПериодОценки = ТекущаяДатаСеанса();
	КонецЕсли;
	
	ЗаполнитьДеревоПоказателей(Новый Соответствие);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДеревоПоказателей(ЗначенияПоКоду)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОценкиБА.Ссылка КАК Ссылка,
	|	ОценкиБА.Код КАК Код,
	|	ОценкиБА.Родитель КАК Родитель,
	|	ЕСТЬNULL(ОценкиБА.ОсновнойПоказатель, ЛОЖЬ) КАК ОсновнойПоказатель,
	|	ЕСТЬNULL(ОценкиБА.ВыводитьВОтчет, ЛОЖЬ) КАК ВыводитьВОтчет,
	|	ЕСТЬNULL(ОценкиБА.НомерПоПорядку, 0) КАК НомерПоПорядку
	|ИЗ
	|	Справочник.ОценкиБА КАК ОценкиБА
	|ГДЕ
	|	НЕ ОценкиБА.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	ОценкиБА.Код";
	
	ТаблицаПоказателей = Запрос.Выполнить().Выгрузить();
	ДочерниеПоРодителю = СгруппироватьПоказателиПоРодителю(ТаблицаПоказателей);
	ДанныеПоказателей = ИндексДанныхПоказателей(ТаблицаПоказателей);
	
	ДеревоРек = РеквизитФормыВЗначение("ДеревоПоказателей");
	ДеревоРек.Строки.Очистить();
	
	НачальныеУзлы = ПолучитьНачальныеУзлыКаталога(ДочерниеПоРодителю);
	ДобавитьУзлыКаталога(
		НачальныеУзлы,
		Неопределено,
		ДеревоРек,
		ДочерниеПоРодителю,
		ДанныеПоказателей,
		ЗначенияПоКоду);
	
	ЗначениеВРеквизитФормы(ДеревоРек, "ДеревоПоказателей");
	
КонецПроцедуры

&НаСервере
Функция ИндексДанныхПоказателей(ТаблицаПоказателей)
	
	ДанныеПоказателей = Новый Соответствие;
	
	Для Каждого СтрокаПоказателя Из ТаблицаПоказателей Цикл
		ДанныеПоказателей.Вставить(СтрокаПоказателя.Ссылка, СтрокаПоказателя);
	КонецЦикла;
	
	Возврат ДанныеПоказателей;
	
КонецФункции

&НаСервере
Функция СгруппироватьПоказателиПоРодителю(ТаблицаПоказателей)
	
	ДочерниеПоРодителю = Новый Соответствие;
	
	Для Каждого СтрокаПоказателя Из ТаблицаПоказателей Цикл
		КлючРодителя = КлючРодителяПоказателя(СтрокаПоказателя.Родитель);
		ДочерниеУзлы = ДочерниеПоРодителю.Получить(КлючРодителя);
		
		Если ДочерниеУзлы = Неопределено Тогда
			ДочерниеУзлы = Новый Массив;
			ДочерниеПоРодителю.Вставить(КлючРодителя, ДочерниеУзлы);
		КонецЕсли;
		
		ДочерниеУзлы.Добавить(СтрокаПоказателя.Ссылка);
	КонецЦикла;
	
	Возврат ДочерниеПоРодителю;
	
КонецФункции

&НаСервере
Функция ПолучитьНачальныеУзлыКаталога(ДочерниеПоРодителю)
	
	КорневыеУзлы = ДочерниеПоРодителю.Получить("");
	Если КорневыеУзлы = Неопределено Тогда
		Возврат Новый Массив;
	КонецЕсли;
	
	// Одна общая группа-обёртка в корне не показывается.
	Если КорневыеУзлы.Количество() = 1 И КорневыеУзлы[0].ЭтоГруппа Тогда
		ДочерниеУзлы = ДочерниеПоРодителю.Получить(Строка(КорневыеУзлы[0].УникальныйИдентификатор()));
		Если ДочерниеУзлы <> Неопределено Тогда
			Возврат ДочерниеУзлы;
		КонецЕсли;
	КонецЕсли;
	
	Возврат КорневыеУзлы;
	
КонецФункции

&НаСервере
Процедура ДобавитьУзлыКаталога(
	УзлыКаталога,
	РодительСтроки,
	ДеревоПриемник,
	ДочерниеПоРодителю,
	ДанныеПоказателей,
	ЗначенияПоКоду)
	
	УзлыКаталога = ОтсортироватьУзлыПоПорядку(УзлыКаталога, ДочерниеПоРодителю, ДанныеПоказателей);
	
	Для Каждого СсылкаПоказателя Из УзлыКаталога Цикл
		ДобавитьУзелКаталога(
			СсылкаПоказателя,
			РодительСтроки,
			ДеревоПриемник,
			ДочерниеПоРодителю,
			ДанныеПоказателей,
			ЗначенияПоКоду);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьУзелКаталога(
	СсылкаПоказателя,
	РодительСтроки,
	ДеревоПриемник,
	ДочерниеПоРодителю,
	ДанныеПоказателей,
	ЗначенияПоКоду)
	
	СтрокаДанных = ДанныеПоказателей.Получить(СсылкаПоказателя);
	Если СтрокаДанных = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоГруппаПоказателя(СтрокаДанных) Тогда
		ОбработатьГруппуПоказателей(
			СсылкаПоказателя,
			РодительСтроки,
			ДеревоПриемник,
			ДочерниеПоРодителю,
			ДанныеПоказателей,
			ЗначенияПоКоду);
		Возврат;
	КонецЕсли;
	
	Если СтрокаДанных.ОсновнойПоказатель = Истина Тогда
		СтрокаОсновного = ДобавитьСтрокуДереваПоказателя(
			СсылкаПоказателя,
			РодительСтроки,
			ДеревоПриемник,
			ДанныеПоказателей,
			ЗначенияПоКоду);
		ДобавитьДочерниеУзлыПоказателя(
			СсылкаПоказателя,
			СтрокаОсновного,
			ДеревоПриемник,
			ДочерниеПоРодителю,
			ДанныеПоказателей,
			ЗначенияПоКоду);
	ИначеЕсли СтрокаДанных.ВыводитьВОтчет = Истина Тогда
		СтрокаПоказателяДерева = ДобавитьСтрокуДереваПоказателя(
			СсылкаПоказателя,
			РодительСтроки,
			ДеревоПриемник,
			ДанныеПоказателей,
			ЗначенияПоКоду);
		ДобавитьДочерниеУзлыПоказателя(
			СсылкаПоказателя,
			СтрокаПоказателяДерева,
			ДеревоПриемник,
			ДочерниеПоРодителю,
			ДанныеПоказателей,
			ЗначенияПоКоду);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьГруппуПоказателей(
	СсылкаГруппы,
	РодительСтроки,
	ДеревоПриемник,
	ДочерниеПоРодителю,
	ДанныеПоказателей,
	ЗначенияПоКоду)
	
	ДочерниеУзлы = ДочерниеПоРодителю.Получить(Строка(СсылкаГруппы.УникальныйИдентификатор()));
	Если ДочерниеУзлы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОсновнойПоказатель = НайтиОсновнойПоказательВГруппе(ДочерниеУзлы, ДанныеПоказателей);
	Если ОсновнойПоказатель = Неопределено Тогда
		ДобавитьУзлыКаталога(
			ДочерниеУзлы,
			РодительСтроки,
			ДеревоПриемник,
			ДочерниеПоРодителю,
			ДанныеПоказателей,
			ЗначенияПоКоду);
		Возврат;
	КонецЕсли;
	
	СтрокаОсновного = ДобавитьСтрокуДереваПоказателя(
		ОсновнойПоказатель,
		РодительСтроки,
		ДеревоПриемник,
		ДанныеПоказателей,
		ЗначенияПоКоду);
	
	Для Каждого СсылкаПоказателя Из ДочерниеУзлы Цикл
		Если СсылкаПоказателя = ОсновнойПоказатель Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаДанных = ДанныеПоказателей.Получить(СсылкаПоказателя);
		Если СтрокаДанных = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЭтоГруппаПоказателя(СтрокаДанных) Тогда
			ОбработатьГруппуПоказателей(
				СсылкаПоказателя,
				СтрокаОсновного,
				ДеревоПриемник,
				ДочерниеПоРодителю,
				ДанныеПоказателей,
				ЗначенияПоКоду);
		ИначеЕсли СтрокаДанных.ВыводитьВОтчет = Истина Тогда
			СтрокаПоказателяДерева = ДобавитьСтрокуДереваПоказателя(
				СсылкаПоказателя,
				СтрокаОсновного,
				ДеревоПриемник,
				ДанныеПоказателей,
				ЗначенияПоКоду);
			ДобавитьДочерниеУзлыПоказателя(
				СсылкаПоказателя,
				СтрокаПоказателяДерева,
				ДеревоПриемник,
				ДочерниеПоРодителю,
				ДанныеПоказателей,
				ЗначенияПоКоду);
		КонецЕсли;
	КонецЦикла;
	
	ДобавитьДочерниеУзлыПоказателя(
		ОсновнойПоказатель,
		СтрокаОсновного,
		ДеревоПриемник,
		ДочерниеПоРодителю,
		ДанныеПоказателей,
		ЗначенияПоКоду);
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьДочерниеУзлыПоказателя(
	СсылкаПоказателя,
	РодительСтроки,
	ДеревоПриемник,
	ДочерниеПоРодителю,
	ДанныеПоказателей,
	ЗначенияПоКоду)
	
	ДочерниеУзлы = ДочерниеПоРодителю.Получить(Строка(СсылкаПоказателя.УникальныйИдентификатор()));
	Если ДочерниеУзлы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДобавитьУзлыКаталога(
		ДочерниеУзлы,
		РодительСтроки,
		ДеревоПриемник,
		ДочерниеПоРодителю,
		ДанныеПоказателей,
		ЗначенияПоКоду);
	
КонецПроцедуры

&НаСервере
Функция ДобавитьСтрокуДереваПоказателя(
	СсылкаПоказателя,
	РодительСтроки,
	ДеревоПриемник,
	ДанныеПоказателей,
	ЗначенияПоКоду)
	
	Если РодительСтроки = Неопределено Тогда
		НоваяСтрока = ДеревоПриемник.Строки.Добавить();
	Иначе
		НоваяСтрока = РодительСтроки.Строки.Добавить();
	КонецЕсли;
	
	НоваяСтрока.Показатель = СсылкаПоказателя;
	
	СтрокаДанных = ДанныеПоказателей.Получить(СсылкаПоказателя);
	Если СтрокаДанных <> Неопределено Тогда
		Значение = ЗначенияПоКоду.Получить(СокрЛП(СтрокаДанных.Код));
		Если Значение <> Неопределено Тогда
			НоваяСтрока.Значение = Значение;
		КонецЕсли;
	КонецЕсли;
	
	Возврат НоваяСтрока;
	
КонецФункции

&НаСервере
Функция НайтиОсновнойПоказательВГруппе(ДочерниеУзлы, ДанныеПоказателей)
	
	Для Каждого СсылкаПоказателя Из ДочерниеУзлы Цикл
		СтрокаДанных = ДанныеПоказателей.Получить(СсылкаПоказателя);
		Если СтрокаДанных = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если Не ЭтоГруппаПоказателя(СтрокаДанных) И СтрокаДанных.ОсновнойПоказатель = Истина Тогда
			Возврат СсылкаПоказателя;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

&НаСервере
Функция ЭтоГруппаПоказателя(СтрокаДанных)
	
	Возврат ЗначениеЗаполнено(СтрокаДанных.Ссылка) И СтрокаДанных.Ссылка.ЭтоГруппа;
	
КонецФункции

&НаСервере
Функция ОтсортироватьУзлыПоПорядку(УзлыКаталога, ДочерниеПоРодителю, ДанныеПоказателей)
	
	Если УзлыКаталога.Количество() <= 1 Тогда
		Возврат УзлыКаталога;
	КонецЕсли;
	
	ТаблицаСортировки = Новый ТаблицаЗначений;
	ТаблицаСортировки.Колонки.Добавить("Ссылка");
	ТаблицаСортировки.Колонки.Добавить("НомерПоПорядку", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 0)));
	ТаблицаСортировки.Колонки.Добавить("Код", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(20)));
	
	Для Каждого СсылкаПоказателя Из УзлыКаталога Цикл
		СтрокаСортировки = ТаблицаСортировки.Добавить();
		СтрокаСортировки.Ссылка = СсылкаПоказателя;
		СтрокаСортировки.НомерПоПорядку = ПолучитьНомерПорядкаУзла(СсылкаПоказателя, ДочерниеПоРодителю, ДанныеПоказателей);
		
		СтрокаДанных = ДанныеПоказателей.Получить(СсылкаПоказателя);
		Если СтрокаДанных <> Неопределено Тогда
			СтрокаСортировки.Код = СтрокаДанных.Код;
		Иначе
			СтрокаСортировки.Код = СсылкаПоказателя.Код;
		КонецЕсли;
	КонецЦикла;
	
	ТаблицаСортировки.Сортировать("НомерПоПорядку Возр, Код");
	
	ОтсортированныеУзлы = Новый Массив;
	Для Каждого СтрокаСортировки Из ТаблицаСортировки Цикл
		ОтсортированныеУзлы.Добавить(СтрокаСортировки.Ссылка);
	КонецЦикла;
	
	Возврат ОтсортированныеУзлы;
	
КонецФункции

&НаСервере
Функция ПолучитьНомерПорядкаУзла(СсылкаПоказателя, ДочерниеПоРодителю, ДанныеПоказателей)
	
	СтрокаДанных = ДанныеПоказателей.Получить(СсылкаПоказателя);
	Если СтрокаДанных = Неопределено Тогда
		Возврат 999999;
	КонецЕсли;
	
	Если ЭтоГруппаПоказателя(СтрокаДанных) Тогда
		ДочерниеУзлы = ДочерниеПоРодителю.Получить(Строка(СсылкаПоказателя.УникальныйИдентификатор()));
		Если ДочерниеУзлы <> Неопределено Тогда
			ОсновнойПоказатель = НайтиОсновнойПоказательВГруппе(ДочерниеУзлы, ДанныеПоказателей);
			Если ОсновнойПоказатель <> Неопределено Тогда
				СтрокаОсновного = ДанныеПоказателей.Получить(ОсновнойПоказатель);
				Возврат НомерПоПорядкуИзСтроки(СтрокаОсновного);
			КонецЕсли;
		КонецЕсли;
		Возврат 999999;
	КонецЕсли;
	
	Если СтрокаДанных.ОсновнойПоказатель = Истина Тогда
		Возврат НомерПоПорядкуИзСтроки(СтрокаДанных);
	КонецЕсли;
	
	Возврат 999999;
	
КонецФункции

&НаСервере
Функция НомерПоПорядкуИзСтроки(СтрокаДанных)
	
	Если СтрокаДанных = Неопределено Или СтрокаДанных.НомерПоПорядку <= 0 Тогда
		Возврат 999999;
	КонецЕсли;
	
	Возврат СтрокаДанных.НомерПоПорядку;
	
КонецФункции

&НаСервере
Функция КлючРодителяПоказателя(Родитель)
	
	Если ЗначениеЗаполнено(Родитель) Тогда
		Возврат Строка(Родитель.УникальныйИдентификатор());
	КонецЕсли;
	
	Возврат "";
	
КонецФункции


&НаКлиенте
Процедура ОснованиеПриИзменении(Элемент)
	ОснованиеПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере

Процедура ОснованиеПриИзмененииНаСервере()
	ПериодОценки = НачалоМесяца(Основание.Дата);
КонецПроцедуры
